-- Protected with MoonSec V2, Discord = discord.gg/gQEH2uZxUk
(function()
	_msec = (function(L_1_arg0, L_2_arg1, L_3_arg2)
		local L_4_ = L_2_arg1[ 85];
		local L_5_ = L_3_arg2["math"]["ldexp"];
		local L_6_ = 2
		local L_7_ = 1
		local L_8_ = L_3_arg2["string"]["byte"];
		local L_9_ = 3
		local L_10_ = L_3_arg2["table"]["concat"]
		local L_11_ = 1
		local L_12_ = 3
		local L_13_ = 3
		local L_14_ = 3
		local L_15_ = 3
		local L_16_ = 3
		local L_17_ = 3
		local L_18_ = 2
		local L_19_ = 2
		local L_20_ = 2
		local L_21_ = 2
		local L_22_ = 2
		local L_23_ = 2
		local L_24_ = 4
		local L_25_ = 4
		local L_26_ = 4
		local L_27_ = 4
		local L_28_ = 4
		local L_29_ = 4
		local L_30_ = L_1_arg0[ 1353];
		local L_31_ = L_3_arg2["string"]["sub"];
		local L_32_ = L_3_arg2[(function(L_55_arg0)
			return type(L_55_arg0):sub(1, 1) .. '\101\116'
		end)('еыхгдрея') .."\109\101\116\97table"];
		local L_33_ = L_3_arg2["table"]["insert"];
		local L_34_ = 0
		local L_35_ = 0
		local L_36_ = L_3_arg2["string"]["char"];
		local L_37_ = function(L_56_arg0, L_57_arg1)
			return L_56_arg0 .. L_57_arg1
		end
		local L_38_ = 16
		local L_39_ = L_3_arg2["select"];
		local L_40_ = 256
		local L_41_ = 2048
		local L_42_ = 52
		local L_43_ = 4
		local L_44_ = L_3_arg2["unpack"] or L_3_arg2["table"]["unpack"];
		local L_45_ = 256
		local L_46_ = L_3_arg2["tonumber"];
		local L_47_ = (function(L_58_arg0)
			local L_59_, L_60_ = 2, 16
			local L_61_ = {
				j = {},
				v = {}
			}
			local L_62_ = - L_11_
			local L_63_ = L_60_ + L_7_
			while true do
				L_61_[L_58_arg0:sub(L_63_, (function()
					L_63_ = L_59_ + L_63_
					return L_63_ - L_7_
				end)())] = (function()
					L_62_ = L_62_ + L_11_
					return L_62_
				end)()
				if L_62_ == (L_38_ - L_11_) then
					L_62_ = ""
					L_60_ = L_34_
					break
				end
			end
			local L_64_ = # L_58_arg0
			while L_63_ < L_64_ + L_7_ do
				L_61_.v[L_60_] = L_58_arg0:sub(L_63_, (function()
					L_63_ = L_59_ + L_63_
					return L_63_ - L_7_
				end)())
				L_60_ = L_60_ + L_11_
				if L_60_ % L_6_ == L_34_ then
					L_60_ = L_35_
					L_33_(L_61_.j, (L_36_((L_61_[L_61_.v[L_35_]] * L_38_) + L_61_[L_61_.v[L_11_]])))
				end
			end
			return L_10_(L_61_.j)
		end)("..:::MoonSec::..яшертыуиопасдфгххяышяадрыдтшггаиуяуфттхтасутшсгшуфыиххдшоятфоирихяапдпидтшхеспутеугтохпраыыыягдифипаыгшуфиофрсхтадрпдяиредгыхясдифрохуаяодсшуушхфохоасияешафрегиаяыпыарягыашгусууоешфахисыиоешгуаетфуаыхштдфоусрушшгдхоргяпытгяияагдашыпштуишудхоооиуреыфшиотряпдуугрттрругфауыхоиттуеышхдсыугогтшяусиигепгсапытфидпогтихдрфяосиияепрышядуиреигепфрошхддидфдогтияяешгупхытфиоыргияоарахрадаооурояеаауыехфппхагадыошшдагтадыгфффгоырсхасаиреогпыгыяаыыашрдддопхуашоопеофспттфигехфспеыуяхятшпдгоитятышифшподыпстхяодшдиаеыаяафияхфсоптехсяяфдоптяяташиуетхыпауяехуашпфеосогияеыффудтухфдеияеапгргхяапуеыгрфяшахипшффхрегппдыыягштгхаиыфшяффуффгохтояшредиосраххдиояшяоатпхтафуууфрфяосгиееагопфтфштаруышафеифягахуоештахтсхиперфпппыифясгоррасысшыпеопппоеидооытфеасгоаггатыфшуштфспшуедеудеыфгфостуфяихшппысшааиипрхггахушеиеуехгяппыеыгепхшопыешифриххрпдтыхгсисопгтххддеидехгроауяшпфиудруяяссиясфиеесгтгыссияедишрфхрадуыодрдяиишяасситефрпяедаиуродасшыгиуухеяфппеофирешгхиуушшрдпдрдхоыргхишшфпосирпфтфяусхсааятгшдаеоттягааыспсиусетфффпссиирогошрхтаыыгшишохфсуусятфдппыргоыуяадридиоыуядфрофдеогттхфсусуофыыпаысяддыигиаышшыдгифрыхясшридришеагрфхсгоеряхапгуяшгддоутудхтфяшсаириеытшясаиырпоирсхтафспоетиярахардуиыеггиххсооырягисеуоштдфпетепатдяысгдфпытдшудаоуяягутохосшуаиртохудиудредяаиыттдупшудхоооауоепфспятргасыисрогяауафадыхшофшдссяусеафдпсдопгыеясдтдыаыыфяффаоаффодтыхгхгфыпфрыяядуорехгепфишсшуршдфыфусситепсппяыоофыдяхдоошафысяфдпофтгаяышяесситиуытшеддиерогуаштфсшуиеяфпфрпстфеыидехгоашааихефхгарупыоуфеефсптпфуиршгдшпхыарыдшыршгхаыыдшфдгоытпяестиатпоерргдаыауодрфгасяуашффшшггрпоышяаясгшпуыериуашпфеосохуушпфаиотфхсддишрифурдхяапуеуфрфхтагируяиоеагрпдпоифрпгыояуиштадеофуохтоуфшхфтпяташядаотеахуагттсууушхфофрспуирысспфыпярсгхафротрфхушшфшпыяохыдтитрярхрпгпаеысосегхеааусешдхоотяеыыияидяипапыяяудыоыргхроаргарисеыфгпистидеопспфуядудииптрхиахушеогшыигпппыеясеигыпиушяпдтогрохггыярсиияеприфхсфиахоситехшаауроытохаааудеогыаяыуяеагшодоошраташсфиоптаяяаауыеяудругупхыооорпхыаиуошгдоорргоеыуятсфиуистфяесгиорггиафыоеедфиегепттфяуеыгааяыихыарыиаупетяхпсеадоотаххсфыаеугиаеуяяаггшсфяоптеуешыфаосоиапышяадрдгпаыгшрдпидррххапушяпгрпиырхссаишуыперихяапсыоятоффсоуоеыфепдыдгдсуоярсдрихутядфшоеагпотояшсадяофтдяддяотрггуаяатсяуушхфоффахуаыдошеггиаяапыгрхфшпиыиярсоуееыфапедфдаиирягпгрсхиошехгсруашеафоттххфхуяддяипреыгштсгофрфиотпхасрудуитфхсдпыярсгфаргыааыхшофшхаатугепидеигяппытрсдтифрухеаоушшагыартыхгсипгепгепсытрхдуихрохшаауршдфыдятияшспиеесгтпфуоеудооератиадуышгфпдятпярсситефгупхуаеодаотрдягагуиеягсдгтсяысфддехгоашыдтрддоиргхпсяупеефсаытфяисхиаршгсаругышдгоотятхсеусетфхдутхяадшисрргдаыыгеофяоатехфстугеуфхпгышяадрифрыггаиутшпфеостдхфсуухрогшпаырядефотрихяапфыохтухустууяяифеагрпдаыыарсдфпрырххстыгешфуоггпсгиредгыяяфяотегыарххтафууоетяхесдыгсдиыеггиаяыпяеяафттяхуахуопттххыахяысгиирягпаедсытггоурхходрауерфхпыышяидяипрегфатуяшуфеоотехаспдоеыгшпиыияпдрисртгфаааяшофшоатахдсуугрпшдппыыясдиифругхаоуршафуодтохгсоияепшапсыияфдоихрохшсдаушдфоогтфяяспиерфядпфыаяхдпошрахрсгуышгфдпятхяесситефгупхыгшшдаоррдхыдяуиеягяпеышятсфиурргоашыхшргпоырххисяптеегтптышяусхиотрхгаруушыфяоитяхпфеусетгипуыпяодуиаыргдаыупшифяоптпхсстуфеугдпоыпяадридрыггаиугшпфаосттхфсуухеогдпаушяддиигыихяапуфшсфхофтаххсоишеаггпдыиягдпоярпхеасухшфгшохтсяшфаиредхяпгуешяфшоерсхтафияшхфапштдярсдиыеггсаяуешефыотрфхуахишешффпртгяыфгиирягдаеутштфыоутртисшухергппытхяифесырехяатуяшудхоотшшхсришеыфхпиытяпдесрртхшауушшофшоатряесыугеигшппыеясдтифругхасупшафродгыяысиияепреяисыоуесхшасипстуршдфыгясдугядфипфыаяуспитсоосрахрададортсграгитршффпятссиуышшдаорогыашддсоытсгысхупефгупттдыпушшрддоыошуушгфиоиргяогфшшсхиоршрушесхиурафиадыаесфяпуафпатхяодшгшптыпяаягшхфяоптетешпгширтгяфдтухфыидрыггспиешпфеостсхфсуухтогшпаыряддыиграхяссуешсфуофтиххсоишеагрпдыыягдпоярсхедсутшффуохтояшдяиртдгыпгыошядпоетрхтафуушхфппштдярсгиытягиаяысшефеотрфхудхуоешфдпртгяыдшиитегпаеыхштдхоурххосшуаерфгпыыеяидеипыегсатыхшуфшоотыхафрудеыгяпиыеяпдиисраеяаууршофшоаттхдсиугеиштппыеясдыифругхаопышафродтыхгсиияепгппсыуяфдаихрпхшааупшдфыогтояяспиеедгтпфыушидоошраорспуышгфихфсоииегфпыгыоятдтиуесхуашрфспуиеяфпххсаипряфсуяыошрсхоурхсытдхисяупуоттяесштдеогаатыггудтиграгсуохфсеусетесхисдуфспоярргдаысеиотехяаиухддишеуфхподоуседхярфхтаиуяшпеегдсууеетгрсягппаырядяфхратышшифшотроаытуххсоишоргрпдыыягдиоярпшеасутшффуохтояусапредгыпгыишядпопрсштафуушхфопштаяусдоиеггиаеыпшадсотрфхуахуоешфапытдяисгифрягпаеысшфдфоирххпсшугутфдпытгшядяиарегхгыыфшудхпхтшхссрудыафгпиыяяпдеисртяфгфыхшофшоатряшсыогеигяппыеясдтотруяхаоушшафродтыяесиияепгепдытягдуихрошшаауршффыохтиятспиоесгтпфыуеудооерахтадупыхфипятпшпссиыефхофсыошшдаоырдхыагуиисфппетсяысфииеххаашыашрддосргхисяупеефспттфяисхипршхдарыдшыдгоотяхпсеусетффпутхяпдшисрргдасыгшифяоатехсстуфеуфхпоышяадпидрыггсхусшпфеоспяудшпфяптршяустоыеахяиихсапуешсрсхесаухетгрпфышхфдеирахоурпхеасдиохрсхясдууфаидедгыпгсаихрсхшсяуошуфтотсопытаярсдфдохытяышшшодсотрфуоштфспутихоыфяысгиирешпаеысштдфоурхходрстерфдпыыяяидяипттгсатыфшуфшоотшхасрудеыфгпиышяпдтистугфаууяшофуоатрхдсыугеигшппырясдтифыугхаоуешафтодтухгдпияепгтпсыояфдуихыохшаауышдфиогтфяядсиеесгипфыаяхдоошыахрадуошгфапятдяедшаиефгапхыпшшдсорргхыагпсеяфппетсятсфиуехшдашыашрдфоыргхисястеефгптышяусхиоршриарыгшыдгоитшхпсеишетффпуыяяодшиарыгдаыыгшффяоптефссхуфеуфхфхсуигяугтпгыаясфеигтяестфхфсуухустфхсдуихшрфхатыыяпуишсфтофсууяешгрпфдсарыыягдифяаыыретдпохтпрхтдяшсаирпртуяссдродфоерсхтхсдиодрфаятаярсдоитдгиаяыпшыдсотрфяоахуоеефапотдяысгпирягпарысшыдфоирххосшуаетфдпитгяидяипрегсатыфшудхоатшхгсрудеыфгарыяяадепсыргфасыхшдфшодтреесгугедгяарыеяддтошрухргпушшафрпутыххсиитуагепсытшпдуоярошшдпурешфыпетияуспиеургтаеыушшдоошрахпафуышгфипутпярссиуефгагяыошшдаопрдхуагуиеуфппетсяысфиуехгоашыашрддоаргхисяяпеофспттфупршффпеыгяопдшгдгоитяыдешффпрыеяасоиуеураригдаыыгогршхесуфссауфеуфхяасуифрогппахшаиуяшпфеосттгфхыояеогшпауытодыигрихрапуешсгуфятуяясоиуеагрпдыыуыдиоярпхтасуушффдсятояшсаипедгупгыошядфдррсхтафудшхфппштгттсдиыегхиаяыашеффдярфхуахуаешфапрудетсгиирягпаеыхштфхдерххпсшудерфдпыугеудяиарегдатыгшуфысстшхдсрудеыфхпиыеяпдеспртгфауыхшофшоатррасыугеигшппыеясдтдорухяаоуршафродтытссиияепгепсыыяфдадярохшаауршдфуогтияуспиеесгыпфыуяхдпошрахрсфуышгфиеотдяесситпстсшуаошфдаоррдтшшрдфптегяессупехдепттхушыгшрддоыаыыошфдгяагипттфяушргапеыошуддиутягдагыдесфсеоффпутхыуеегипофтасыгшифяфшаиыдшосыуофппоышштдридрырыядфтупрггдсфуееогееягыпаырядшогисшыыстуешсфтофтуххфдсшаегдпдыыягяагопаутяддипшрсяшсоягсаиредрияисгиорффиасутшефоусрфхошыярсдиыеггиаяорыедропрфхуахфооетряысххфдоиирягпгысдоешяхыасутшадгоордпдтгяидядхпитгшоддоояетоышхасрудуфырятсшииршгтпорхшыдгодешгссыияяыугеигяасудясдтифттгхаоушедфродтухгсаияепгепсытяфдоихрохшаауршдфыогтояясаиеефгтсфыуяхдпошрсхрстуышгфипятаяесфитефгупхыошшдаоррдхысяуиетфппетсятяаиурягодшипшрфшоытехисыупеешяптыряудяиоршгадрисшыфтоитухпсиусеахяпуытяодхиартгдасыгшсшшоптехсдеуфеифхпдпеяадридоеггаоуярпхшостпхфсаухрргшаяахяддаиготхяаауешсфтпшоиххсоишиигрпфыыеггуояргхеахутеофуахтдяшсхирршгыааыитядпоетяхтсдууеуфосштаярдшиырегиасыпредсоттехустуоеффадртдяыдрииртгпадысртдфоуттхосыуаегфдсытгяидыипригссяыфеодхоотихадрудеыфгсиыяяпдоисрагфаиыхеафшоатахддеугеигяасыеясддифтргхаоушедфродтгхгдтияепгепсытяфддихтшхшадуредфыогтдяядеиершгтсфыуяхдфошргхрсиуыргфипятгяедяитехгудхыошшдхортсхысыуитяфппеыяятдшиурагодшыашрфшоытрхисеупыефсптыеяудриорсгадрыдшыфроиттхпсфусттффпуытяодуиарыгдсиыгшифуопыехсстуфтуфхпоыияадпидруггспуяшпфпосышхфсуухрагшпаысядфеигрихяссуешсффофырххсоишеагрпдысягфяоярсхессутшффсохышяшдяиртдгыпгыдшядфоетухтдфуушхффпштхярдеиыыггиаяыгшефаотттхудхуоешфхпрыяяыдпииыягпаеуяштфеоутыхогшуаергшпыыеяидаипыегсатуешуфроотдхафрудеыгрпиыыяпдоистугфаууышогшоатрхдфыугеигуппыоясдыифтогхаоуошагяодтыхгдпияепгапсушяфдуихтахшааудшдгеогтияяспиеесгапфыхяхдаоштахрадуашггяпятхяефситефгспхыдшшфыорыдхыагудеяфгпеыдятгфиуехгфашупшрфроыыгхисяугеефхптыояуфхиоршгхарушшыфхоиияхпсеияетгшпуыпяогшиаррхшаыуешифсопуехсстиееугтпоуеяафыидрыхтаиияшпфеосутхфсуиыеогипаытядфиигрихиапухшсфтофыоххсоипеахяпдыыягфпоярпхсасишшффуохтояшсаипедггпгыпшяфпоерсхпафухшхфгпшыяятсдиыеггхаяыашедфоттшриахуоешгепртфяысгифрягпаеыдштдфоурххосшуаерфдпыыяяидяипяыгсатыфшудхоотшхатсишеыфгпидяудергиаяясауыхшогрдфтрхгсыухеигяппуттгдтоярухяаоушшагыдотыяесииеепгепсыатядуотрохшааутшдфпогтиртспиеесгупфыуяхдосырахрадуышгфипятпрусситефгппхыошшдасирдхыагуоеяфппетсшысфиаехгаашысшрфепоргхисяореефдпттгяудрспршгаариушыдхоитурхсеусетгспуыяяодеиариефаыыгшифгоптрхссоагеуфхпоусяадтидрсяшаиушшпгдостыхфсуухедеепаырядфхигрохяаппршсфоофтоххссишеаштпдыаягдаоярсхесшаашффаохыфяшссирршгыаепошядпоеыяхтагууершппштаярфуиыехгиаяоашедхотрххусеуоешяспрышяыдшиирегпаоугштфшоуыпхосеуаеофдппохяидяиптдгсаыыфшашяоотшхадгудеуфгпиаеяпдуисртгфауыхшоягоатихдсуугеигяппоаясдоифрогхаоушшафподтыхгсоияепгепдытяфдуихрохшаауашдфыогтияхспиеесгыпфыуяхдоошрахрадуышгфипятпяесситефгупхыошшдаоррдхыагуаеяфппетсятсфиуехгоашыашрддоыргхисяусеефспттфяусхиоршгсарыдшыдгоитяхпсеуфет");
		local L_48_ = 71
		local L_49_ = 104
		local L_50_ = L_11_;
		local L_51_ = {}
		L_51_ = {
			[ 1] = function()
				local L_65_, L_66_, L_67_, L_68_ = L_8_(L_47_, L_50_, L_50_ + L_9_);
				L_50_ = L_50_ + L_43_;
				L_49_ = (L_49_ + (L_48_ * L_43_)) % L_45_;
				return (((L_68_ + L_49_ - (L_48_) + L_40_ * (L_43_ * L_6_)) % L_40_) * ((L_6_ * L_41_) ^ L_6_)) + (((L_67_ + L_49_ - (L_48_ * L_6_) + L_40_ * (L_6_ ^ L_9_)) % L_45_) * (L_40_ * L_45_)) + (((L_66_ + L_49_ - (L_48_ * L_9_) + L_41_) % L_45_) * L_40_) + ((L_65_ + L_49_ - (L_48_ * L_43_) + L_41_) % L_45_);
			end,
			[ 2] = function(L_69_arg0, L_70_arg1, L_71_arg2)
				local L_72_ = L_8_(L_47_, L_50_, L_50_);
				L_50_ = L_50_ + L_7_;
				L_49_ = (L_49_ + (L_48_)) % L_45_;
				return ((L_72_ + L_49_ - (L_48_) + L_41_) % L_40_);
			end,
			[ 3] = function()
				local L_73_, L_74_ = L_8_(L_47_, L_50_, L_50_ + L_6_);
				L_49_ = (L_49_ + (L_48_ * L_6_)) % L_45_;
				L_50_ = L_50_ + L_6_;
				return (((L_74_ + L_49_ - (L_48_) + L_40_ * (L_6_ * L_43_)) % L_40_) * L_45_) + ((L_73_ + L_49_ - (L_48_ * L_6_) + L_45_ * (L_6_ ^ L_9_)) % L_40_);
			end,
			[ 4] = function(L_75_arg0, L_76_arg1, L_77_arg2)
				if L_77_arg2 then
					local L_78_ = (L_75_arg0 / L_6_ ^ (L_76_arg1 - L_11_)) % L_6_ ^ ((L_77_arg2 - L_7_) - (L_76_arg1 - L_11_) + L_7_);
					return L_78_ - L_78_ % L_11_;
				else
					local L_79_ = L_6_ ^ (L_76_arg1 - L_7_);
					return (L_75_arg0 % (L_79_ + L_79_) >= L_79_) and L_11_ or L_35_;
				end;
			end,
			[ 5] = function()
				local L_80_ = L_51_[ 1]();
				local L_81_ = L_51_[ 1]();
				local L_82_ = L_11_;
				local L_83_ = (L_51_[ 4](L_81_, L_7_, L_38_ + L_43_) * (L_6_ ^ (L_38_ * L_6_))) + L_80_;
				local L_84_ = L_51_[ 4](L_81_, 21, 31);
				local L_85_ = ((- L_11_) ^ L_51_[ 4](L_81_, 32));
				if (L_84_ == L_35_) then
					if (L_83_ == L_34_) then
						return L_85_ * L_35_;
					else
						L_84_ = L_7_;
						L_82_ = L_34_;
					end;
				elseif (L_84_ == (L_40_ * (L_6_ ^ L_9_)) - L_7_) then
					return (L_83_ == L_35_) and (L_85_ * (L_7_ / L_34_)) or (L_85_ * (L_35_ / L_34_));
				end;
				return L_5_(L_85_, L_84_ - ((L_45_ * (L_43_)) - L_11_)) * (L_82_ + (L_83_ / (L_6_ ^ L_42_)));
			end,
			[ 6] = function(L_86_arg0, L_87_arg1, L_88_arg2)
				local L_89_;
				if (not L_86_arg0) then
					L_86_arg0 = L_51_[ 1]();
					if (L_86_arg0 == L_35_) then
						return '';
					end;
				end;
				L_89_ = L_31_(L_47_, L_50_, L_50_ + L_86_arg0 - L_11_);
				L_50_ = L_50_ + L_86_arg0;
				local L_90_ = ''
				for L_91_forvar0 = L_7_, # L_89_ do
					L_90_ = L_30_(L_90_, L_36_((L_8_(L_31_(L_89_, L_91_forvar0, L_91_forvar0)) + L_49_) % L_45_))
					L_49_ = (L_49_ + L_48_) % L_40_
				end
				return L_90_;
			end
		}
		local function L_52_func(...)
			return {
				...
			}, L_39_('#', ...)
		end
		local function L_53_func()
			local L_92_ = {};
			local L_93_ = {};
			local L_94_ = {};
			local L_95_ = {
				L_92_,
				L_93_,
				nil,
				L_94_
			};
			local L_96_ = {}
			local L_97_ = 4
			local L_98_ = {
				[ 2] = (function(L_100_arg0)
					return not (# L_100_arg0 == L_51_[ 2]())
				end),
				[ 3] = (function(L_101_arg0)
					return L_51_[ 5]()
				end),
				[ 0] = (function(L_102_arg0)
					return L_51_[ 6]()
				end),
				[ 4] = (function(L_103_arg0)
					local L_104_ = L_51_[ 6]()
					local L_105_ = ''
					local L_106_ = 1
					for L_107_forvar0 = 1, # L_104_ do
						L_106_ = (L_106_ + L_97_) % L_45_
						L_105_ = L_30_(L_105_, L_36_((L_8_(L_104_:sub(L_107_forvar0, L_107_forvar0)) + L_106_) % L_40_))
					end
					return L_105_
				end)
			};
			local L_99_ = L_51_[ 1]()
			for L_108_forvar0 = 1, L_99_ do
				local L_109_ = L_51_[ 2]();
				local L_110_;
				local L_111_ = L_98_[L_109_ % 8];
				L_96_[L_108_forvar0] = L_111_ and L_111_({});
			end;
			for L_112_forvar0 = 1, L_51_[ 1]() do
				local L_113_ = L_51_[ 2]();
				if (L_51_[ 4](L_113_, L_11_, L_7_) == L_34_) then
					local L_114_ = L_51_[ 4](L_113_, L_6_, L_9_);
					local L_115_ = L_51_[ 4](L_113_, L_43_, L_6_ + L_43_);
					local L_116_ = {
						L_51_[ 3](),
						L_51_[ 3](),
						nil,
						nil
					};
					local L_117_ = {
						[ 0] = function()
							L_116_[L_15_] = L_51_[ 3]();
							L_116_[L_26_] = L_51_[ 3]();
						end,
						[ 1] = function()
							L_116_[L_12_] = L_51_[ 1]();
						end,
						[ 2] = function()
							L_116_[L_12_] = L_51_[ 1]() - (L_6_ ^ L_38_)
						end,
						[ 3] = function()
							L_116_[L_17_] = L_51_[ 1]() - (L_6_ ^ L_38_)
							L_116_[L_27_] = L_51_[ 3]();
						end
					};
					L_117_[L_114_]();
					if (L_51_[ 4](L_115_, L_7_, L_11_) == L_7_) then
						L_116_[L_23_] = L_96_[L_116_[L_20_]]
					end
					if (L_51_[ 4](L_115_, L_6_, L_6_) == L_11_) then
						L_116_[L_15_] = L_96_[L_116_[L_14_]]
					end
					if (L_51_[ 4](L_115_, L_9_, L_9_) == L_7_) then
						L_116_[L_26_] = L_96_[L_116_[L_25_]]
					end
					L_92_[L_112_forvar0] = L_116_;
				end
			end;
			for L_118_forvar0 = L_7_, L_51_[ 1]() do
				L_93_[L_118_forvar0 - L_7_] = L_53_func();
			end;
			L_95_[3] = L_51_[ 2]();
			return L_95_;
		end;
		local function L_54_func(L_119_arg0, L_120_arg1, L_121_arg2)
			local L_122_ = L_119_arg0[L_6_];
			local L_123_ = L_119_arg0[L_9_];
			local L_124_ = L_119_arg0[L_11_];
			return (function(...)
				local L_125_ = L_11_
				L_125_ *= -1
				local L_126_ = L_125_;
				local L_127_ = L_122_;
				local L_128_ = {};
				local L_129_ = L_52_func
				local L_130_ = L_39_('#', ...) - L_7_;
				local L_131_ = {
					...
				};
				local L_132_ = L_123_;
				local L_133_ = L_124_;
				local L_134_ = {};
				local L_135_ = L_11_;
				local L_136_ = {};
				for L_140_forvar0 = 0, L_130_ do
					if (L_140_forvar0 >= L_132_) then
						L_136_[L_140_forvar0 - L_132_] = L_131_[L_140_forvar0 + L_7_];
					else
						L_128_[L_140_forvar0] = L_131_[L_140_forvar0 + L_11_];
					end;
				end;
				local L_137_ = L_130_ - L_132_ + L_11_
				local L_138_;
				local L_139_;
				while true do
					L_138_ = L_133_[L_135_];
					L_139_ = L_138_[ 1];
					L_37_ =7588080
					while 46 >= L_139_ do
						L_37_ -= L_37_
						L_37_ =2418666
						while L_139_ <= 22 do
							L_37_ -= L_37_
							L_37_ =2203016
							while L_139_ <= 10 do
								L_37_ -= L_37_
								L_37_ =7027107
								while 4 >= L_139_ do
									L_37_ -= L_37_
									L_37_ =629841
									while 1 >= L_139_ do
										L_37_ -= L_37_
										L_37_ =710402
										while 0 < L_139_ do
											L_37_ -= L_37_
											local L_141_ = L_138_[L_21_];
											local L_142_ = L_138_[L_24_];
											local L_143_ = L_141_ + 2
											local L_144_ = {
												L_128_[L_141_](L_128_[L_141_ + 1], L_128_[L_143_])
											};
											for L_146_forvar0 = 1, L_142_ do
												L_128_[L_143_ + L_146_forvar0] = L_144_[L_146_forvar0];
											end;
											local L_145_ = L_144_[1]
											if L_145_ then
												L_128_[L_143_] = L_145_
												L_135_ = L_138_[L_17_];
											else
												L_135_ = L_135_ + L_11_;
											end;
											break
										end
										while 539 == (L_37_) / 1318 do
											L_128_[L_138_[L_22_]] = L_128_[L_138_[L_17_]][L_138_[L_25_]];
											break
										end;
										break;
									end
									while 2957 == (L_37_) / 213 do
										L_37_ =5513416
										while L_139_ <= 2 do
											L_37_ -= L_37_
											L_128_[L_138_[L_23_]] = L_128_[L_138_[L_15_]][L_128_[L_138_[L_28_]]];
											break;
										end
										while (L_37_) / 3368 == 1637 do
											L_37_ =847302
											while 3 < L_139_ do
												L_37_ -= L_37_
												local L_147_;
												L_128_[L_138_[L_22_]] = L_128_[L_138_[L_13_]][L_138_[L_29_]];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_21_]][L_138_[L_13_]] = L_138_[L_27_];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_22_]] = L_128_[L_138_[L_16_]][L_138_[L_25_]];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_20_]] = L_128_[L_138_[L_14_]][L_138_[L_25_]];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_18_]][L_138_[L_16_]] = L_138_[L_28_];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_18_]] = L_128_[L_138_[L_17_]][L_138_[L_27_]];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_19_]] = L_128_[L_138_[L_17_]][L_138_[L_25_]];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_18_]] = L_121_arg2[L_138_[L_13_]];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_21_]] = L_128_[L_138_[L_16_]][L_138_[L_25_]];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_22_]] = L_138_[L_14_];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_19_]] = L_138_[L_16_];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_19_]] = L_138_[L_12_];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_147_ = L_138_[L_19_]
												L_128_[L_147_] = L_128_[L_147_](L_44_(L_128_, L_147_ + L_11_, L_138_[L_17_]))
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_23_]][L_138_[L_16_]] = L_128_[L_138_[L_28_]];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_19_]] = L_128_[L_138_[L_16_]][L_138_[L_25_]];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_18_]] = L_128_[L_138_[L_17_]][L_138_[L_25_]];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_20_]][L_138_[L_12_]] = L_138_[L_27_];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_23_]] = L_128_[L_138_[L_12_]][L_138_[L_26_]];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_22_]] = L_128_[L_138_[L_13_]][L_138_[L_25_]];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_22_]][L_138_[L_16_]] = L_138_[L_24_];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_21_]] = L_128_[L_138_[L_16_]][L_138_[L_25_]];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_20_]] = L_128_[L_138_[L_15_]][L_138_[L_28_]];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_20_]] = L_121_arg2[L_138_[L_14_]];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_23_]] = L_128_[L_138_[L_14_]][L_138_[L_28_]];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_18_]] = L_138_[L_14_];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_22_]] = L_138_[L_14_];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_21_]] = L_138_[L_14_];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_147_ = L_138_[L_18_]
												L_128_[L_147_] = L_128_[L_147_](L_44_(L_128_, L_147_ + L_11_, L_138_[L_15_]))
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_19_]][L_138_[L_14_]] = L_128_[L_138_[L_28_]];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_19_]] = L_128_[L_138_[L_13_]][L_138_[L_25_]];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_21_]] = L_128_[L_138_[L_13_]][L_138_[L_27_]];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_21_]][L_138_[L_13_]] = L_138_[L_26_];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_21_]] = L_128_[L_138_[L_17_]][L_138_[L_25_]];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_19_]] = L_128_[L_138_[L_12_]][L_138_[L_26_]];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_20_]][L_138_[L_16_]] = L_138_[L_29_];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_22_]] = L_128_[L_138_[L_15_]][L_138_[L_24_]];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_18_]] = L_128_[L_138_[L_16_]][L_138_[L_27_]];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_19_]] = L_121_arg2[L_138_[L_14_]];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_18_]] = L_128_[L_138_[L_17_]][L_138_[L_24_]];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_20_]] = L_138_[L_12_];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_18_]] = L_138_[L_15_];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_18_]] = L_138_[L_12_];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_147_ = L_138_[L_23_]
												L_128_[L_147_] = L_128_[L_147_](L_44_(L_128_, L_147_ + L_11_, L_138_[L_13_]))
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_18_]][L_138_[L_15_]] = L_128_[L_138_[L_25_]];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_21_]] = L_128_[L_138_[L_15_]][L_138_[L_26_]];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_23_]] = L_128_[L_138_[L_17_]][L_138_[L_29_]];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_21_]][L_138_[L_13_]] = L_138_[L_26_];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_19_]] = L_128_[L_138_[L_12_]][L_138_[L_26_]];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_21_]] = L_128_[L_138_[L_13_]][L_138_[L_26_]];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_22_]][L_138_[L_14_]] = L_138_[L_24_];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_18_]] = L_128_[L_138_[L_13_]][L_138_[L_25_]];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_22_]] = L_128_[L_138_[L_16_]][L_138_[L_29_]];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_18_]] = L_121_arg2[L_138_[L_16_]];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_23_]] = L_128_[L_138_[L_13_]][L_138_[L_27_]];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_18_]] = L_138_[L_17_];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_23_]] = L_138_[L_16_];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_18_]] = L_138_[L_15_];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_147_ = L_138_[L_18_]
												L_128_[L_147_] = L_128_[L_147_](L_44_(L_128_, L_147_ + L_11_, L_138_[L_12_]))
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_20_]][L_138_[L_13_]] = L_128_[L_138_[L_26_]];
												break
											end
											while 566 == (L_37_) / 1497 do
												L_128_[L_138_[L_19_]] = L_121_arg2[L_138_[L_15_]];
												break
											end;
											break;
										end
										break;
									end
									break;
								end
								while (L_37_) / 2253 == 3119 do
									L_37_ =818435
									while L_139_ <= 7 do
										L_37_ -= L_37_
										L_37_ =981274
										while L_139_ <= 5 do
											L_37_ -= L_37_
											if (L_128_[L_138_[L_18_]] ~= L_128_[L_138_[L_24_]]) then
												L_135_ = L_135_ + L_7_;
											else
												L_135_ = L_138_[L_15_];
											end;
											break;
										end
										while (L_37_) / 589 == 1666 do
											L_37_ =615351
											while L_139_ > 6 do
												L_37_ -= L_37_
												local L_148_ = L_138_[L_23_]
												L_128_[L_148_](L_44_(L_128_, L_148_ + L_7_, L_138_[L_14_]))
												break
											end
											while 957 == (L_37_) / 643 do
												do
													return
												end;
												break
											end;
											break;
										end
										break;
									end
									while 857 == (L_37_) / 955 do
										L_37_ =42390
										while 8 >= L_139_ do
											L_37_ -= L_37_
											L_128_[L_138_[L_21_]] = # L_128_[L_138_[L_17_]];
											break;
										end
										while (L_37_) / 135 == 314 do
											L_37_ =684967
											while L_139_ > 9 do
												L_37_ -= L_37_
												local L_149_ = {
													L_128_,
													L_138_
												};
												L_149_[L_7_][L_149_[L_6_][L_20_]] = L_149_[L_11_][L_149_[L_6_][L_28_]] + L_149_[L_7_][L_149_[L_6_][L_15_]];
												break
											end
											while 1627 == (L_37_) / 421 do
												if (L_128_[L_138_[L_21_]] ~= L_138_[L_29_]) then
													L_135_ = L_135_ + L_7_;
												else
													L_135_ = L_138_[L_17_];
												end;
												break
											end;
											break;
										end
										break;
									end
									break;
								end
								break;
							end
							while (L_37_) / 766 == 2876 do
								L_37_ =3392594
								while L_139_ <= 16 do
									L_37_ -= L_37_
									L_37_ =2226709
									while 13 >= L_139_ do
										L_37_ -= L_37_
										L_37_ =704004
										while 11 >= L_139_ do
											L_37_ -= L_37_
											L_135_ = L_138_[L_17_];
											break;
										end
										while 578 == (L_37_) / 1218 do
											L_37_ =2736762
											while L_139_ > 12 do
												L_37_ -= L_37_
												local L_150_ = L_138_[L_21_]
												L_128_[L_150_] = L_128_[L_150_](L_128_[L_150_ + L_7_])
												break
											end
											while 714 == (L_37_) / 3833 do
												L_128_[L_138_[L_18_]] = L_128_[L_138_[L_16_]] - L_128_[L_138_[L_25_]];
												break
											end;
											break;
										end
										break;
									end
									while (L_37_) / 3463 == 643 do
										L_37_ =828920
										while 14 >= L_139_ do
											L_37_ -= L_37_
											local L_151_ = L_138_[L_23_];
											local L_152_ = L_128_[L_151_ + 2];
											local L_153_ = L_128_[L_151_] + L_152_;
											L_128_[L_151_] = L_153_;
											if (L_152_ > 0) then
												if (L_153_ <= L_128_[L_151_ + 1]) then
													L_135_ = L_138_[L_17_];
													L_128_[L_151_ + 3] = L_153_;
												end
											elseif (L_153_ >= L_128_[L_151_ + 1]) then
												L_135_ = L_138_[L_12_];
												L_128_[L_151_ + 3] = L_153_;
											end
											break;
										end
										while 340 == (L_37_) / 2438 do
											L_37_ =1232100
											while 15 < L_139_ do
												L_37_ -= L_37_
												if L_128_[L_138_[L_21_]] then
													L_135_ = L_135_ + L_11_;
												else
													L_135_ = L_138_[L_15_];
												end;
												break
											end
											while (L_37_) / 740 == 1665 do
												L_128_[L_138_[L_23_]] = L_120_arg1[L_138_[L_16_]];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_21_]] = # L_128_[L_138_[L_15_]];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_120_arg1[L_138_[L_17_]] = L_128_[L_138_[L_20_]];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_22_]] = L_120_arg1[L_138_[L_17_]];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_22_]] = # L_128_[L_138_[L_15_]];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_120_arg1[L_138_[L_13_]] = L_128_[L_138_[L_21_]];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												do
													return
												end;
												break
											end;
											break;
										end
										break;
									end
									break;
								end
								while 4034 == (L_37_) / 841 do
									L_37_ =2663934
									while L_139_ <= 19 do
										L_37_ -= L_37_
										L_37_ =1733100
										while 17 >= L_139_ do
											L_37_ -= L_37_
											local L_154_ = L_138_[L_23_]
											L_128_[L_154_](L_128_[L_154_ + L_7_])
											break;
										end
										while (L_37_) / 2650 == 654 do
											L_37_ =2763519
											while L_139_ > 18 do
												L_37_ -= L_37_
												if (L_128_[L_138_[L_19_]] == L_128_[L_138_[L_27_]]) then
													L_135_ = L_135_ + L_7_;
												else
													L_135_ = L_138_[L_12_];
												end;
												break
											end
											while (L_37_) / 3641 == 759 do
												local L_155_;
												local L_156_;
												L_128_[L_138_[L_20_]] = L_121_arg2[L_138_[L_15_]];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_156_ = L_138_[L_20_];
												L_155_ = L_128_[L_138_[L_12_]];
												L_128_[L_156_ + 1] = L_155_;
												L_128_[L_156_] = L_155_[L_138_[L_24_]];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_21_]] = L_138_[L_15_];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_156_ = L_138_[L_21_]
												L_128_[L_156_] = L_128_[L_156_](L_44_(L_128_, L_156_ + L_11_, L_138_[L_13_]))
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_22_]] = L_128_[L_138_[L_17_]][L_138_[L_28_]];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_156_ = L_138_[L_20_];
												L_155_ = L_128_[L_138_[L_13_]];
												L_128_[L_156_ + 1] = L_155_;
												L_128_[L_156_] = L_155_[L_138_[L_27_]];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_156_ = L_138_[L_20_]
												L_128_[L_156_] = L_128_[L_156_](L_128_[L_156_ + L_7_])
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_21_]] = L_121_arg2[L_138_[L_12_]];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_156_ = L_138_[L_20_];
												L_155_ = L_128_[L_138_[L_12_]];
												L_128_[L_156_ + 1] = L_155_;
												L_128_[L_156_] = L_155_[L_138_[L_29_]];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_22_]] = L_138_[L_13_];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_156_ = L_138_[L_19_]
												L_128_[L_156_] = L_128_[L_156_](L_44_(L_128_, L_156_ + L_11_, L_138_[L_16_]))
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_19_]] = L_128_[L_138_[L_16_]][L_138_[L_25_]];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_156_ = L_138_[L_21_];
												L_155_ = L_128_[L_138_[L_14_]];
												L_128_[L_156_ + 1] = L_155_;
												L_128_[L_156_] = L_155_[L_138_[L_24_]];
												break
											end;
											break;
										end
										break;
									end
									while 3198 == (L_37_) / 833 do
										L_37_ =747405
										while 20 >= L_139_ do
											L_37_ -= L_37_
											local L_157_;
											local L_158_;
											local L_159_;
											local L_160_;
											L_128_[L_138_[L_22_]] = L_121_arg2[L_138_[L_12_]];
											L_135_ = L_135_ + L_11_;
											L_138_ = L_133_[L_135_];
											L_128_[L_138_[L_18_]] = L_128_[L_138_[L_14_]][L_138_[L_29_]];
											L_135_ = L_135_ + L_11_;
											L_138_ = L_133_[L_135_];
											L_160_ = L_138_[L_22_];
											L_159_ = L_128_[L_138_[L_16_]];
											L_128_[L_160_ + 1] = L_159_;
											L_128_[L_160_] = L_159_[L_138_[L_27_]];
											L_135_ = L_135_ + L_11_;
											L_138_ = L_133_[L_135_];
											L_128_[L_138_[L_21_]] = L_128_[L_138_[L_17_]];
											L_135_ = L_135_ + L_11_;
											L_138_ = L_133_[L_135_];
											L_128_[L_138_[L_23_]] = L_128_[L_138_[L_12_]];
											L_135_ = L_135_ + L_11_;
											L_138_ = L_133_[L_135_];
											L_160_ = L_138_[L_22_]
											L_128_[L_160_] = L_128_[L_160_](L_44_(L_128_, L_160_ + L_11_, L_138_[L_15_]))
											L_135_ = L_135_ + L_11_;
											L_138_ = L_133_[L_135_];
											L_160_ = L_138_[L_19_];
											L_159_ = L_128_[L_138_[L_16_]];
											L_128_[L_160_ + 1] = L_159_;
											L_128_[L_160_] = L_159_[L_138_[L_27_]];
											L_135_ = L_135_ + L_11_;
											L_138_ = L_133_[L_135_];
											L_160_ = L_138_[L_23_]
											L_128_[L_160_] = L_128_[L_160_](L_128_[L_160_ + L_7_])
											L_135_ = L_135_ + L_11_;
											L_138_ = L_133_[L_135_];
											L_158_ = {
												L_128_,
												L_138_
											};
											L_158_[L_7_][L_158_[L_6_][L_23_]] = L_158_[L_11_][L_158_[L_6_][L_29_]] + L_158_[L_7_][L_158_[L_6_][L_15_]];
											L_135_ = L_135_ + L_11_;
											L_138_ = L_133_[L_135_];
											L_128_[L_138_[L_20_]] = L_128_[L_138_[L_15_]] % L_138_[L_29_];
											L_135_ = L_135_ + L_11_;
											L_138_ = L_133_[L_135_];
											L_160_ = L_138_[L_22_]
											L_128_[L_160_] = L_128_[L_160_](L_128_[L_160_ + L_7_])
											L_135_ = L_135_ + L_11_;
											L_138_ = L_133_[L_135_];
											L_159_ = L_138_[L_16_];
											L_157_ = L_128_[L_159_]
											for L_161_forvar0 = L_159_ + 1, L_138_[L_24_] do
												L_157_ = L_157_ .. L_128_[L_161_forvar0];
											end;
											L_128_[L_138_[L_21_]] = L_157_;
											L_135_ = L_135_ + L_11_;
											L_138_ = L_133_[L_135_];
											L_158_ = {
												L_128_,
												L_138_
											};
											L_158_[L_7_][L_158_[L_6_][L_21_]] = L_158_[L_11_][L_158_[L_6_][L_26_]] + L_158_[L_7_][L_158_[L_6_][L_15_]];
											L_135_ = L_135_ + L_11_;
											L_138_ = L_133_[L_135_];
											L_128_[L_138_[L_18_]] = L_128_[L_138_[L_17_]] % L_138_[L_25_];
											break;
										end
										while (L_37_) / 765 == 977 do
											L_37_ =5578450
											while 21 < L_139_ do
												L_37_ -= L_37_
												local L_162_ = L_138_[L_22_]
												L_128_[L_162_] = L_128_[L_162_](L_44_(L_128_, L_162_ + L_11_, L_138_[L_13_]))
												break
											end
											while (L_37_) / 3782 == 1475 do
												local L_163_ = L_138_[L_21_]
												L_128_[L_163_] = L_128_[L_163_](L_44_(L_128_, L_163_ + L_11_, L_138_[L_15_]))
												break
											end;
											break;
										end
										break;
									end
									break;
								end
								break;
							end
							break;
						end
						while 2946 == (L_37_) / 821 do
							L_37_ =1954440
							while 34 >= L_139_ do
								L_37_ -= L_37_
								L_37_ =6300954
								while L_139_ <= 28 do
									L_37_ -= L_37_
									L_37_ =4376384
									while 25 >= L_139_ do
										L_37_ -= L_37_
										L_37_ =3665382
										while 23 >= L_139_ do
											L_37_ -= L_37_
											L_121_arg2[L_138_[L_17_]] = L_128_[L_138_[L_20_]];
											break;
										end
										while (L_37_) / 1379 == 2658 do
											L_37_ =16638177
											while L_139_ > 24 do
												L_37_ -= L_37_
												local L_164_ = L_138_[L_20_]
												L_128_[L_164_](L_128_[L_164_ + L_7_])
												break
											end
											while 4087 == (L_37_) / 4071 do
												L_128_[L_138_[L_22_]] = (L_138_[L_12_] ~= 0);
												break
											end;
											break;
										end
										break;
									end
									while (L_37_) / 2242 == 1952 do
										L_37_ =973319
										while 26 >= L_139_ do
											L_37_ -= L_37_
											local L_165_;
											local L_166_;
											local L_167_, L_168_;
											local L_169_;
											local L_170_;
											L_128_[L_138_[L_22_]] = L_121_arg2[L_138_[L_12_]];
											L_135_ = L_135_ + L_11_;
											L_138_ = L_133_[L_135_];
											L_128_[L_138_[L_19_]] = L_121_arg2[L_138_[L_15_]];
											L_135_ = L_135_ + L_11_;
											L_138_ = L_133_[L_135_];
											L_128_[L_138_[L_19_]] = L_120_arg1[L_138_[L_14_]];
											L_135_ = L_135_ + L_11_;
											L_138_ = L_133_[L_135_];
											L_128_[L_138_[L_18_]] = L_128_[L_138_[L_15_]][L_128_[L_138_[L_25_]]];
											L_135_ = L_135_ + L_11_;
											L_138_ = L_133_[L_135_];
											L_170_ = L_138_[L_20_];
											L_169_ = L_128_[L_138_[L_13_]];
											L_128_[L_170_ + 1] = L_169_;
											L_128_[L_170_] = L_169_[L_138_[L_28_]];
											L_135_ = L_135_ + L_11_;
											L_138_ = L_133_[L_135_];
											L_170_ = L_138_[L_21_]
											L_167_, L_168_ = L_129_(L_128_[L_170_](L_128_[L_170_ + L_7_]))
											L_126_ = L_168_ + L_170_ - L_11_
											L_166_ = 0;
											for L_171_forvar0 = L_170_, L_126_ do
												L_166_ = L_166_ + L_11_;
												L_128_[L_171_forvar0] = L_167_[L_166_];
											end;
											L_135_ = L_135_ + L_11_;
											L_138_ = L_133_[L_135_];
											L_170_ = L_138_[L_23_]
											L_167_ = {
												L_128_[L_170_](L_44_(L_128_, L_170_ + 1, L_126_))
											};
											L_166_ = 0;
											for L_172_forvar0 = L_170_, L_138_[L_26_] do
												L_166_ = L_166_ + L_11_;
												L_128_[L_172_forvar0] = L_167_[L_166_];
											end
											L_135_ = L_135_ + L_11_;
											L_138_ = L_133_[L_135_];
											L_135_ = L_138_[L_17_];
											break;
										end
										while 761 == (L_37_) / 1279 do
											L_37_ =42828
											while L_139_ > 27 do
												L_37_ -= L_37_
												L_128_[L_138_[L_19_]][L_138_[L_13_]] = L_138_[L_24_];
												break
											end
											while (L_37_) / 516 == 83 do
												local L_173_ = L_138_[L_19_];
												local L_174_ = L_128_[L_173_]
												local L_175_ = L_128_[L_173_ + 2];
												if (L_175_ > 0) then
													if (L_174_ > L_128_[L_173_ + 1]) then
														L_135_ = L_138_[L_16_];
													else
														L_128_[L_173_ + 3] = L_174_;
													end
												elseif (L_174_ < L_128_[L_173_ + 1]) then
													L_135_ = L_138_[L_12_];
												else
													L_128_[L_173_ + 3] = L_174_;
												end
												break
											end;
											break;
										end
										break;
									end
									break;
								end
								while 2662 == (L_37_) / 2367 do
									L_37_ =5238009
									while 31 >= L_139_ do
										L_37_ -= L_37_
										L_37_ =6192370
										while L_139_ <= 29 do
											L_37_ -= L_37_
											local L_176_ = L_138_[L_19_]
											L_128_[L_176_] = L_128_[L_176_]()
											break;
										end
										while 3799 == (L_37_) / 1630 do
											L_37_ =8693536
											while L_139_ > 30 do
												L_37_ -= L_37_
												L_128_[L_138_[L_21_]] = L_128_[L_138_[L_16_]][L_138_[L_29_]];
												break
											end
											while 2539 == (L_37_) / 3424 do
												local L_177_;
												local L_178_;
												local L_179_, L_180_;
												local L_181_;
												local L_182_;
												L_128_[L_138_[L_19_]] = L_121_arg2[L_138_[L_13_]];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_21_]] = L_121_arg2[L_138_[L_15_]];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_182_ = L_138_[L_20_];
												L_181_ = L_128_[L_138_[L_14_]];
												L_128_[L_182_ + 1] = L_181_;
												L_128_[L_182_] = L_181_[L_138_[L_29_]];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_182_ = L_138_[L_23_]
												L_179_, L_180_ = L_129_(L_128_[L_182_](L_128_[L_182_ + L_7_]))
												L_126_ = L_180_ + L_182_ - L_11_
												L_178_ = 0;
												for L_183_forvar0 = L_182_, L_126_ do
													L_178_ = L_178_ + L_11_;
													L_128_[L_183_forvar0] = L_179_[L_178_];
												end;
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_182_ = L_138_[L_20_]
												L_179_ = {
													L_128_[L_182_](L_44_(L_128_, L_182_ + 1, L_126_))
												};
												L_178_ = 0;
												for L_184_forvar0 = L_182_, L_138_[L_27_] do
													L_178_ = L_178_ + L_11_;
													L_128_[L_184_forvar0] = L_179_[L_178_];
												end
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_135_ = L_138_[L_15_];
												break
											end;
											break;
										end
										break;
									end
									while (L_37_) / 3843 == 1363 do
										L_37_ =7683039
										while L_139_ <= 32 do
											L_37_ -= L_37_
											local L_185_ = L_138_[L_19_]
											L_128_[L_185_](L_44_(L_128_, L_185_ + L_7_, L_138_[L_16_]))
											break;
										end
										while 3339 == (L_37_) / 2301 do
											L_37_ =415800
											while L_139_ > 33 do
												L_37_ -= L_37_
												local L_186_ = L_138_[L_19_]
												L_128_[L_186_] = L_128_[L_186_]()
												break
											end
											while 440 == (L_37_) / 945 do
												if not L_128_[L_138_[L_23_]] then
													L_135_ = L_135_ + L_7_;
												else
													L_135_ = L_138_[L_17_];
												end;
												break
											end;
											break;
										end
										break;
									end
									break;
								end
								break;
							end
							while 1780 == (L_37_) / 1098 do
								L_37_ =11175325
								while L_139_ <= 40 do
									L_37_ -= L_37_
									L_37_ =711204
									while L_139_ <= 37 do
										L_37_ -= L_37_
										L_37_ =8628819
										while L_139_ <= 35 do
											L_37_ -= L_37_
											do
												return L_128_[L_138_[L_19_]]
											end
											break;
										end
										while 2993 == (L_37_) / 2883 do
											L_37_ =4250100
											while L_139_ > 36 do
												L_37_ -= L_37_
												L_128_[L_138_[L_22_]][L_128_[L_138_[L_17_]]] = L_128_[L_138_[L_25_]];
												break
											end
											while (L_37_) / 1550 == 2742 do
												L_128_[L_138_[L_19_]][L_138_[L_13_]] = L_138_[L_29_];
												break
											end;
											break;
										end
										break;
									end
									while 564 == (L_37_) / 1261 do
										L_37_ =12409488
										while 38 >= L_139_ do
											L_37_ -= L_37_
											local L_187_ = L_127_[L_138_[L_16_]];
											local L_188_;
											local L_189_ = {};
											L_188_ = L_32_({}, {
												__index = function(L_190_arg0, L_191_arg1)
													local L_192_ = L_189_[L_191_arg1];
													return L_192_[1][L_192_[2]];
												end,
												__newindex = function(L_193_arg0, L_194_arg1, L_195_arg2)
													local L_196_ = L_189_[L_194_arg1]
													L_196_[1][L_196_[2]] = L_195_arg2;
												end;
											});
											for L_197_forvar0 = 1, L_138_[L_25_] do
												L_135_ = L_135_ + L_7_;
												local L_198_ = L_133_[L_135_];
												if L_198_[ 1] == 52 then
													L_189_[L_197_forvar0 - 1] = {
														L_128_,
														L_198_[L_14_]
													};
												else
													L_189_[L_197_forvar0 - 1] = {
														L_120_arg1,
														L_198_[L_15_]
													};
												end;
												L_134_[# L_134_ + 1] = L_189_;
											end;
											L_128_[L_138_[L_22_]] = L_54_func(L_187_, L_188_, L_121_arg2);
											break;
										end
										while 3276 == (L_37_) / 3788 do
											L_37_ =1027344
											while 39 < L_139_ do
												L_37_ -= L_37_
												local L_199_;
												local L_200_;
												local L_201_;
												L_128_[L_138_[L_20_]] = L_138_[L_13_];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_21_]] = L_138_[L_16_];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_18_]] = # L_128_[L_138_[L_14_]];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_21_]] = L_138_[L_15_];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_201_ = L_138_[L_22_];
												L_200_ = L_128_[L_201_]
												L_199_ = L_128_[L_201_ + 2];
												if (L_199_ > 0) then
													if (L_200_ > L_128_[L_201_ + 1]) then
														L_135_ = L_138_[L_13_];
													else
														L_128_[L_201_ + 3] = L_200_;
													end
												elseif (L_200_ < L_128_[L_201_ + 1]) then
													L_135_ = L_138_[L_16_];
												else
													L_128_[L_201_ + 3] = L_200_;
												end
												break
											end
											while 272 == (L_37_) / 3777 do
												local L_202_ = L_138_[L_23_]
												local L_203_, L_204_ = L_129_(L_128_[L_202_](L_128_[L_202_ + L_7_]))
												L_126_ = L_204_ + L_202_ - L_11_
												local L_205_ = 0;
												for L_206_forvar0 = L_202_, L_126_ do
													L_205_ = L_205_ + L_11_;
													L_128_[L_206_forvar0] = L_203_[L_205_];
												end;
												break
											end;
											break;
										end
										break;
									end
									break;
								end
								while 3325 == (L_37_) / 3361 do
									L_37_ =3501351
									while 43 >= L_139_ do
										L_37_ -= L_37_
										L_37_ =5131086
										while L_139_ <= 41 do
											L_37_ -= L_37_
											L_128_[L_138_[L_18_]] = # L_128_[L_138_[L_13_]];
											break;
										end
										while 2146 == (L_37_) / 2391 do
											L_37_ =2049328
											while L_139_ > 42 do
												L_37_ -= L_37_
												L_128_[L_138_[L_18_]] = L_128_[L_138_[L_12_]];
												break
											end
											while (L_37_) / 2936 == 698 do
												L_128_[L_138_[L_21_]] = L_138_[L_12_];
												break
											end;
											break;
										end
										break;
									end
									while (L_37_) / 1341 == 2611 do
										L_37_ =11142
										while 44 >= L_139_ do
											L_37_ -= L_37_
											do
												return
											end;
											break;
										end
										while (L_37_) / 18 == 619 do
											L_37_ =1263015
											while 45 < L_139_ do
												L_37_ -= L_37_
												L_128_[L_138_[L_18_]] = L_54_func(L_127_[L_138_[L_13_]], nil, L_121_arg2);
												break
											end
											while (L_37_) / 1105 == 1143 do
												if (L_128_[L_138_[L_22_]] == L_128_[L_138_[L_29_]]) then
													L_135_ = L_135_ + L_7_;
												else
													L_135_ = L_138_[L_14_];
												end;
												break
											end;
											break;
										end
										break;
									end
									break;
								end
								break;
							end
							break;
						end
						break;
					end
					while 2342 == (L_37_) / 3240 do
						L_37_ =3345867
						while L_139_ <= 70 do
							L_37_ -= L_37_
							L_37_ =2213760
							while 58 >= L_139_ do
								L_37_ -= L_37_
								L_37_ =1346897
								while L_139_ <= 52 do
									L_37_ -= L_37_
									L_37_ =1833348
									while 49 >= L_139_ do
										L_37_ -= L_37_
										L_37_ =10826024
										while 47 >= L_139_ do
											L_37_ -= L_37_
											L_128_[L_138_[L_20_]] = L_128_[L_138_[L_12_]] % L_138_[L_27_];
											break;
										end
										while (L_37_) / 3784 == 2861 do
											L_37_ =350640
											while 48 < L_139_ do
												L_37_ -= L_37_
												L_128_[L_138_[L_23_]] = L_128_[L_138_[L_16_]] - L_128_[L_138_[L_24_]];
												break
											end
											while (L_37_) / 1948 == 180 do
												L_128_[L_138_[L_19_]] = L_54_func(L_127_[L_138_[L_13_]], nil, L_121_arg2);
												break
											end;
											break;
										end
										break;
									end
									while (L_37_) / 748 == 2451 do
										L_37_ =89250
										while L_139_ <= 50 do
											L_37_ -= L_37_
											L_128_[L_138_[L_21_]] = {};
											break;
										end
										while 70 == (L_37_) / 1275 do
											L_37_ =11799050
											while L_139_ > 51 do
												L_37_ -= L_37_
												L_128_[L_138_[L_18_]] = L_128_[L_138_[L_13_]];
												break
											end
											while 3215 == (L_37_) / 3670 do
												local L_207_ = L_127_[L_138_[L_12_]];
												local L_208_;
												local L_209_ = {};
												L_208_ = L_32_({}, {
													__index = function(L_210_arg0, L_211_arg1)
														local L_212_ = L_209_[L_211_arg1];
														return L_212_[1][L_212_[2]];
													end,
													__newindex = function(L_213_arg0, L_214_arg1, L_215_arg2)
														local L_216_ = L_209_[L_214_arg1]
														L_216_[1][L_216_[2]] = L_215_arg2;
													end;
												});
												for L_217_forvar0 = 1, L_138_[L_25_] do
													L_135_ = L_135_ + L_7_;
													local L_218_ = L_133_[L_135_];
													if L_218_[ 1] == 52 then
														L_209_[L_217_forvar0 - 1] = {
															L_128_,
															L_218_[L_16_]
														};
													else
														L_209_[L_217_forvar0 - 1] = {
															L_120_arg1,
															L_218_[L_16_]
														};
													end;
													L_134_[# L_134_ + 1] = L_209_;
												end;
												L_128_[L_138_[L_19_]] = L_54_func(L_207_, L_208_, L_121_arg2);
												break
											end;
											break;
										end
										break;
									end
									break;
								end
								while 1129 == (L_37_) / 1193 do
									L_37_ =2200470
									while L_139_ <= 55 do
										L_37_ -= L_37_
										L_37_ =8249911
										while L_139_ <= 53 do
											L_37_ -= L_37_
											L_128_[L_138_[L_21_]] = L_120_arg1[L_138_[L_12_]];
											break;
										end
										while 2087 == (L_37_) / 3953 do
											L_37_ =7658100
											while L_139_ > 54 do
												L_37_ -= L_37_
												local L_219_ = L_138_[L_18_]
												local L_220_ = {
													L_128_[L_219_](L_44_(L_128_, L_219_ + 1, L_126_))
												};
												local L_221_ = 0;
												for L_222_forvar0 = L_219_, L_138_[L_29_] do
													L_221_ = L_221_ + L_11_;
													L_128_[L_222_forvar0] = L_220_[L_221_];
												end
												break
											end
											while (L_37_) / 3175 == 2412 do
												L_128_[L_138_[L_21_]][L_128_[L_138_[L_13_]]] = L_128_[L_138_[L_25_]];
												break
											end;
											break;
										end
										break;
									end
									while 1230 == (L_37_) / 1789 do
										L_37_ =302442
										while 56 >= L_139_ do
											L_37_ -= L_37_
											do
												return L_128_[L_138_[L_22_]]
											end
											break;
										end
										while 798 == (L_37_) / 379 do
											L_37_ =4738138
											while L_139_ > 57 do
												L_37_ -= L_37_
												L_128_[L_138_[L_22_]] = L_128_[L_138_[L_14_]] % L_138_[L_28_];
												break
											end
											while (L_37_) / 1241 == 3818 do
												local L_223_ = L_138_[L_13_];
												local L_224_ = L_128_[L_223_]
												for L_225_forvar0 = L_223_ + 1, L_138_[L_25_] do
													L_224_ = L_224_ .. L_128_[L_225_forvar0];
												end;
												L_128_[L_138_[L_18_]] = L_224_;
												break
											end;
											break;
										end
										break;
									end
									break;
								end
								break;
							end
							while (L_37_) / 960 == 2306 do
								L_37_ =323544
								while 64 >= L_139_ do
									L_37_ -= L_37_
									L_37_ =11778025
									while 61 >= L_139_ do
										L_37_ -= L_37_
										L_37_ =14466606
										while L_139_ <= 59 do
											L_37_ -= L_37_
											local L_226_ = L_138_[L_20_];
											local L_227_ = L_128_[L_138_[L_16_]];
											L_128_[L_226_ + 1] = L_227_;
											L_128_[L_226_] = L_227_[L_138_[L_27_]];
											break;
										end
										while 3801 == (L_37_) / 3806 do
											L_37_ =2549130
											while 60 < L_139_ do
												L_37_ -= L_37_
												L_128_[L_138_[L_22_]] = (L_138_[L_12_] ~= 0);
												break
											end
											while (L_37_) / 2741 == 930 do
												L_128_[L_138_[L_19_]] = L_121_arg2[L_138_[L_15_]];
												break
											end;
											break;
										end
										break;
									end
									while 2975 == (L_37_) / 3959 do
										L_37_ =2207560
										while L_139_ <= 62 do
											L_37_ -= L_37_
											L_128_[L_138_[L_21_]] = L_120_arg1[L_138_[L_12_]];
											break;
										end
										while (L_37_) / 2410 == 916 do
											L_37_ =2862607
											while 63 < L_139_ do
												L_37_ -= L_37_
												L_128_[L_138_[L_19_]] = (L_138_[L_14_] ~= 0);
												L_135_ = L_135_ + L_7_;
												break
											end
											while 1321 == (L_37_) / 2167 do
												local L_228_ = L_138_[L_23_]
												L_128_[L_228_](L_44_(L_128_, L_228_ + L_7_, L_126_))
												break
											end;
											break;
										end
										break;
									end
									break;
								end
								while 663 == (L_37_) / 488 do
									L_37_ =13621
									while L_139_ <= 67 do
										L_37_ -= L_37_
										L_37_ =12032550
										while L_139_ <= 65 do
											L_37_ -= L_37_
											L_135_ = L_138_[L_15_];
											break;
										end
										while 4050 == (L_37_) / 2971 do
											L_37_ =12994995
											while 66 < L_139_ do
												L_37_ -= L_37_
												L_128_[L_138_[L_21_]] = L_138_[L_17_];
												break
											end
											while 4017 == (L_37_) / 3235 do
												local L_229_ = {
													L_128_,
													L_138_
												};
												L_229_[L_7_][L_229_[L_6_][L_20_]] = L_229_[L_11_][L_229_[L_6_][L_28_]] + L_229_[L_7_][L_229_[L_6_][L_15_]];
												break
											end;
											break;
										end
										break;
									end
									while 53 == (L_37_) / 257 do
										L_37_ =6294985
										while 68 >= L_139_ do
											L_37_ -= L_37_
											L_128_[L_138_[L_20_]][L_138_[L_17_]] = L_128_[L_138_[L_25_]];
											break;
										end
										while 1541 == (L_37_) / 4085 do
											L_37_ =12291258
											while L_139_ > 69 do
												L_37_ -= L_37_
												if (L_128_[L_138_[L_22_]] ~= L_128_[L_138_[L_24_]]) then
													L_135_ = L_135_ + L_7_;
												else
													L_135_ = L_138_[L_17_];
												end;
												break
											end
											while (L_37_) / 4074 == 3017 do
												local L_230_ = L_138_[L_18_];
												local L_231_ = L_128_[L_138_[L_14_]];
												L_128_[L_230_ + 1] = L_231_;
												L_128_[L_230_] = L_231_[L_138_[L_28_]];
												break
											end;
											break;
										end
										break;
									end
									break;
								end
								break;
							end
							break;
						end
						while (L_37_) / 1967 == 1701 do
							L_37_ =5572280
							while 82 >= L_139_ do
								L_37_ -= L_37_
								L_37_ =8469046
								while L_139_ <= 76 do
									L_37_ -= L_37_
									L_37_ =4406710
									while L_139_ <= 73 do
										L_37_ -= L_37_
										L_37_ =297438
										while L_139_ <= 71 do
											L_37_ -= L_37_
											L_128_[L_138_[L_19_]] = L_128_[L_138_[L_15_]][L_138_[L_26_]];
											L_135_ = L_135_ + L_11_;
											L_138_ = L_133_[L_135_];
											L_128_[L_138_[L_22_]] = L_128_[L_138_[L_14_]][L_138_[L_26_]];
											L_135_ = L_135_ + L_11_;
											L_138_ = L_133_[L_135_];
											L_128_[L_138_[L_22_]] = L_128_[L_138_[L_12_]][L_138_[L_29_]];
											L_135_ = L_135_ + L_11_;
											L_138_ = L_133_[L_135_];
											L_128_[L_138_[L_21_]] = L_120_arg1[L_138_[L_15_]];
											L_135_ = L_135_ + L_11_;
											L_138_ = L_133_[L_135_];
											L_128_[L_138_[L_20_]] = L_128_[L_138_[L_17_]][L_138_[L_28_]];
											L_135_ = L_135_ + L_11_;
											L_138_ = L_133_[L_135_];
											if (L_128_[L_138_[L_22_]] ~= L_128_[L_138_[L_29_]]) then
												L_135_ = L_135_ + L_7_;
											else
												L_135_ = L_138_[L_16_];
											end;
											break;
										end
										while 178 == (L_37_) / 1671 do
											L_37_ =3991026
											while L_139_ > 72 do
												L_37_ -= L_37_
												L_128_[L_138_[L_22_]]();
												break
											end
											while 2693 == (L_37_) / 1482 do
												local L_232_ = L_138_[L_22_];
												local L_233_ = L_128_[L_232_]
												local L_234_ = L_128_[L_232_ + 2];
												if (L_234_ > 0) then
													if (L_233_ > L_128_[L_232_ + 1]) then
														L_135_ = L_138_[L_17_];
													else
														L_128_[L_232_ + 3] = L_233_;
													end
												elseif (L_233_ < L_128_[L_232_ + 1]) then
													L_135_ = L_138_[L_16_];
												else
													L_128_[L_232_ + 3] = L_233_;
												end
												break
											end;
											break;
										end
										break;
									end
									while 1298 == (L_37_) / 3395 do
										L_37_ =756600
										while L_139_ <= 74 do
											L_37_ -= L_37_
											local L_235_;
											L_121_arg2[L_138_[L_14_]] = L_128_[L_138_[L_19_]];
											L_135_ = L_135_ + L_11_;
											L_138_ = L_133_[L_135_];
											L_128_[L_138_[L_18_]] = L_121_arg2[L_138_[L_17_]];
											L_135_ = L_135_ + L_11_;
											L_138_ = L_133_[L_135_];
											L_235_ = L_138_[L_19_]
											L_128_[L_235_] = L_128_[L_235_]()
											L_135_ = L_135_ + L_11_;
											L_138_ = L_133_[L_135_];
											L_128_[L_138_[L_18_]] = L_121_arg2[L_138_[L_13_]];
											L_135_ = L_135_ + L_11_;
											L_138_ = L_133_[L_135_];
											L_128_[L_138_[L_20_]] = L_128_[L_138_[L_16_]][L_128_[L_138_[L_28_]]];
											L_135_ = L_135_ + L_11_;
											L_138_ = L_133_[L_135_];
											L_128_[L_138_[L_18_]] = L_128_[L_138_[L_15_]][L_138_[L_29_]];
											L_135_ = L_135_ + L_11_;
											L_138_ = L_133_[L_135_];
											L_128_[L_138_[L_21_]] = L_121_arg2[L_138_[L_13_]];
											L_135_ = L_135_ + L_11_;
											L_138_ = L_133_[L_135_];
											L_128_[L_138_[L_21_]] = L_128_[L_138_[L_16_]][L_138_[L_26_]];
											L_135_ = L_135_ + L_11_;
											L_138_ = L_133_[L_135_];
											L_128_[L_138_[L_20_]] = L_121_arg2[L_138_[L_15_]];
											L_135_ = L_135_ + L_11_;
											L_138_ = L_133_[L_135_];
											L_128_[L_138_[L_23_]] = L_128_[L_138_[L_17_]][L_138_[L_24_]];
											break;
										end
										while 2910 == (L_37_) / 260 do
											L_37_ =6578541
											while 75 < L_139_ do
												L_37_ -= L_37_
												L_128_[L_138_[L_20_]] = L_128_[L_138_[L_16_]][L_128_[L_138_[L_28_]]];
												break
											end
											while 1767 == (L_37_) / 3723 do
												local L_236_ = L_138_[L_23_]
												local L_237_, L_238_ = L_129_(L_128_[L_236_](L_128_[L_236_ + L_7_]))
												L_126_ = L_238_ + L_236_ - L_11_
												local L_239_ = 0;
												for L_240_forvar0 = L_236_, L_126_ do
													L_239_ = L_239_ + L_11_;
													L_128_[L_240_forvar0] = L_237_[L_239_];
												end;
												break
											end;
											break;
										end
										break;
									end
									break;
								end
								while 4058 == (L_37_) / 2087 do
									L_37_ =10741650
									while 79 >= L_139_ do
										L_37_ -= L_37_
										L_37_ =2014608
										while 77 >= L_139_ do
											L_37_ -= L_37_
											local L_241_ = L_138_[L_23_]
											L_128_[L_241_](L_44_(L_128_, L_241_ + L_7_, L_126_))
											break;
										end
										while (L_37_) / 752 == 2679 do
											L_37_ =1892891
											while L_139_ > 78 do
												L_37_ -= L_37_
												local L_242_ = L_138_[L_21_];
												local L_243_ = L_128_[L_242_ + 2];
												local L_244_ = L_128_[L_242_] + L_243_;
												L_128_[L_242_] = L_244_;
												if (L_243_ > 0) then
													if (L_244_ <= L_128_[L_242_ + 1]) then
														L_135_ = L_138_[L_17_];
														L_128_[L_242_ + 3] = L_244_;
													end
												elseif (L_244_ >= L_128_[L_242_ + 1]) then
													L_135_ = L_138_[L_17_];
													L_128_[L_242_ + 3] = L_244_;
												end
												break
											end
											while (L_37_) / 1001 == 1891 do
												local L_245_ = L_138_[L_19_]
												local L_246_ = {
													L_128_[L_245_](L_44_(L_128_, L_245_ + 1, L_126_))
												};
												local L_247_ = 0;
												for L_248_forvar0 = L_245_, L_138_[L_28_] do
													L_247_ = L_247_ + L_11_;
													L_128_[L_248_forvar0] = L_246_[L_247_];
												end
												break
											end;
											break;
										end
										break;
									end
									while (L_37_) / 3769 == 2850 do
										L_37_ =424800
										while 80 >= L_139_ do
											L_37_ -= L_37_
											local L_249_ = L_138_[L_20_];
											local L_250_ = L_138_[L_29_];
											local L_251_ = L_249_ + 2
											local L_252_ = {
												L_128_[L_249_](L_128_[L_249_ + 1], L_128_[L_251_])
											};
											for L_254_forvar0 = 1, L_250_ do
												L_128_[L_251_ + L_254_forvar0] = L_252_[L_254_forvar0];
											end;
											local L_253_ = L_252_[1]
											if L_253_ then
												L_128_[L_251_] = L_253_
												L_135_ = L_138_[L_17_];
											else
												L_135_ = L_135_ + L_11_;
											end;
											break;
										end
										while (L_37_) / 590 == 720 do
											L_37_ =2375592
											while 81 < L_139_ do
												L_37_ -= L_37_
												L_128_[L_138_[L_18_]] = (L_138_[L_15_] ~= 0);
												L_135_ = L_135_ + L_7_;
												break
											end
											while (L_37_) / 744 == 3193 do
												L_128_[L_138_[L_20_]]();
												break
											end;
											break;
										end
										break;
									end
									break;
								end
								break;
							end
							while (L_37_) / 1960 == 2843 do
								L_37_ =4148144
								while L_139_ <= 88 do
									L_37_ -= L_37_
									L_37_ =11449386
									while L_139_ <= 85 do
										L_37_ -= L_37_
										L_37_ =106120
										while 83 >= L_139_ do
											L_37_ -= L_37_
											L_120_arg1[L_138_[L_15_]] = L_128_[L_138_[L_19_]];
											break;
										end
										while (L_37_) / 280 == 379 do
											L_37_ =4510300
											while 84 < L_139_ do
												L_37_ -= L_37_
												L_120_arg1[L_138_[L_13_]] = L_128_[L_138_[L_19_]];
												break
											end
											while (L_37_) / 1702 == 2650 do
												L_121_arg2[L_138_[L_14_]] = L_128_[L_138_[L_19_]];
												break
											end;
											break;
										end
										break;
									end
									while (L_37_) / 2938 == 3897 do
										L_37_ =6878928
										while 86 >= L_139_ do
											L_37_ -= L_37_
											L_128_[L_138_[L_21_]][L_138_[L_13_]] = L_128_[L_138_[L_29_]];
											break;
										end
										while 2429 == (L_37_) / 2832 do
											L_37_ =9709059
											while 87 < L_139_ do
												L_37_ -= L_37_
												if not L_128_[L_138_[L_19_]] then
													L_135_ = L_135_ + L_7_;
												else
													L_135_ = L_138_[L_13_];
												end;
												break
											end
											while (L_37_) / 3803 == 2553 do
												local L_255_ = L_138_[L_20_]
												L_128_[L_255_] = L_128_[L_255_](L_128_[L_255_ + L_7_])
												break
											end;
											break;
										end
										break;
									end
									break;
								end
								while 2072 == (L_37_) / 2002 do
									L_37_ =522071
									while 91 >= L_139_ do
										L_37_ -= L_37_
										L_37_ =2121196
										while 89 >= L_139_ do
											L_37_ -= L_37_
											local L_256_;
											local L_257_;
											L_128_[L_138_[L_18_]] = L_120_arg1[L_138_[L_17_]];
											L_135_ = L_135_ + L_11_;
											L_138_ = L_133_[L_135_];
											L_128_[L_138_[L_20_]] = L_128_[L_138_[L_17_]][L_138_[L_28_]];
											L_135_ = L_135_ + L_11_;
											L_138_ = L_133_[L_135_];
											L_128_[L_138_[L_19_]] = L_128_[L_138_[L_12_]][L_138_[L_25_]];
											L_135_ = L_135_ + L_11_;
											L_138_ = L_133_[L_135_];
											L_257_ = L_138_[L_21_];
											L_256_ = L_128_[L_138_[L_14_]];
											L_128_[L_257_ + 1] = L_256_;
											L_128_[L_257_] = L_256_[L_138_[L_26_]];
											L_135_ = L_135_ + L_11_;
											L_138_ = L_133_[L_135_];
											L_128_[L_138_[L_21_]] = L_138_[L_14_];
											L_135_ = L_135_ + L_11_;
											L_138_ = L_133_[L_135_];
											L_257_ = L_138_[L_22_]
											L_128_[L_257_] = L_128_[L_257_](L_44_(L_128_, L_257_ + L_11_, L_138_[L_13_]))
											L_135_ = L_135_ + L_11_;
											L_138_ = L_133_[L_135_];
											if not L_128_[L_138_[L_22_]] then
												L_135_ = L_135_ + L_7_;
											else
												L_135_ = L_138_[L_12_];
											end;
											break;
										end
										while (L_37_) / 679 == 3124 do
											L_37_ =119460
											while L_139_ > 90 do
												L_37_ -= L_37_
												L_128_[L_138_[L_20_]]();
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_21_]] = L_121_arg2[L_138_[L_13_]];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_21_]]();
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_23_]] = L_121_arg2[L_138_[L_13_]];
												L_135_ = L_135_ + L_11_;
												L_138_ = L_133_[L_135_];
												L_128_[L_138_[L_19_]]();
												break
											end
											while 60 == (L_37_) / 1991 do
												if (L_128_[L_138_[L_18_]] ~= L_138_[L_29_]) then
													L_135_ = L_135_ + L_7_;
												else
													L_135_ = L_138_[L_16_];
												end;
												break
											end;
											break;
										end
										break;
									end
									while (L_37_) / 1531 == 341 do
										L_37_ =4478154
										while 92 >= L_139_ do
											L_37_ -= L_37_
											if L_128_[L_138_[L_18_]] then
												L_135_ = L_135_ + L_11_;
											else
												L_135_ = L_138_[L_17_];
											end;
											break;
										end
										while (L_37_) / 2766 == 1619 do
											L_37_ =3496000
											while 93 < L_139_ do
												L_37_ -= L_37_
												local L_258_ = L_138_[L_14_];
												local L_259_ = L_128_[L_258_]
												for L_260_forvar0 = L_258_ + 1, L_138_[L_27_] do
													L_259_ = L_259_ .. L_128_[L_260_forvar0];
												end;
												L_128_[L_138_[L_20_]] = L_259_;
												break
											end
											while 3040 == (L_37_) / 1150 do
												L_128_[L_138_[L_23_]] = {};
												break
											end;
											break;
										end
										break;
									end
									break;
								end
								break;
							end
							break;
						end
						break;
					end
					L_135_ += L_7_
				end;
			end);
		end;
		return L_54_func(L_53_func(), {}, L_4_())()
	end)
	_msec({
		[ 185] ="string",
		[ 734] ="ldexp",
		[ 253] ="byte",
		[ 384] ="char",
		[ 519] ="table",
		[ 487] ="sub",
		[ 834] ="concat",
		[ 643] ="math",
		[ 1353] = (function(L_270_arg0, L_271_arg1)
			return ((1165 / 233) == (- # 'table.concat = nil' + (78 - 57)) and '\48' .. '\195' or L_270_arg0 .. ((not '\20\95\69' and '\90' .. '\180' or L_271_arg1))) or '\199\203\95'
		end),
		[ 918] ="insert",
		[ 1075] ="unpack",
		[ 1149] ="select",
		[ 1267] ="tonumber"
	}, {
		[ 85] = ((getfenv))
	}, ((getfenv))())
end)()